// нахождение НОД и его линейного разложения по расширенному алгоритму
// Эвклида

// Нахождение НОД алгоритмом Евклида
function euclid(r1,r2) {
    let q = 0,
        x1 = 1, x2 = 0,
        y1 = 0, y2 = 1;
    
    const a = r1, b = r2;

    while (r1 !== 0 && r2 !== 0) {
        q = ~~(r1 / r2);
        [r1, r2] = [r2, r1 % r2];

        [x1, x2] = [x2, x1 - (q * x2)];
        [y1, y2] = [y2, y1 - (q * y2)];
    }

    return {
        r: r1,
        u: x1,
        v: y1,
        a: a,
        b: b
    };
}

module.exports = euclid;